lvx/base/Catalogs/бит_СоставляющиеПлатежейПоФинДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СоставляющиеПлатежейПоФинДоговорам</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаПоФинДоговору</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыПлатежейПоФинансовымДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_ТипыПлатежейПоФинансовымДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыПлатежейПоФинансовымДоговорам</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияЗаНеиспользованныйЛимит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_СоставляющиеПлатежейПоФинДоговорам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КомиссияЗаВыдачу";
	Элемент.Наименование              = НСтр("ru='Комиссия за выдачу';en='Issue fee'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Комиссия;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КомиссияЗаНеиспользованныйЛимит";
	Элемент.Наименование              = НСтр("ru='Комиссия за неиспользованный лимит';en='Fee for unused limit'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.КомиссияЗаНеиспользованныйЛимит;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПогашениеОсновногоДолга";
	Элемент.Наименование              = НСтр("ru='Погашение основного долга';en='Repayment of principal'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.ОсновнойДолг;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Проценты";
	Элемент.Наименование              = НСтр("ru='Проценты';en='Percent'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Проценты;
		
КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
